tutorials/particlesQGDFoam/2D/backwardFacingStep/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiQGDThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.96;
    }

    
    thermodynamics
    {
        Hf              0;
        Sf              0;
        Cp              1005;
    }
    
    transport
    {
        mu   1.85e-05;
        As   1.458e-06;
        Ts   110.4;
        Pr   1;
    }
}

dpdt yes;

chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/reactions";

inertSpecie mixture;//air; //Ydefault

liquids
{
}

solids
{
    C
    {
        defaultCoeffs   yes;
    }
}

QGD
{
    implicitDiffusion false;
    QGDCoeffs	constTau;
    constTauDict
    {
	Tau	0.1;
    }
    /*QGDCoeffs constScPrModel1;
    constScPrModel1Dict
    {
        ScQGD 0.0;
        PrQGD 0.72;
    }*/
}

// ************************************************************************* //
